import { CgCalendarDates } from 'react-icons/cg';

const posts = [
  {
    title: "الفوائد الصحية للساونا العادية واستخدام الجاكوزي",
    date: "25 يونيو 2023. 12:42pm ",
    img: "https://placehold.co/600x400",
    postInfo: ["هناك العديد من الفوائد لاستخدام الجاكوزي والساونا بانتظام. يمكن أن تستفيد صحة الشخص من بضع دقائق فقط يوميًا ، جسديًا وعقليًا. العديد من الأبحاث تدعم قيمة الانخراط في كلا النشاطين. ومع ذلك ، فإن قلة من الناس يدركون النطاق الكامل للمزايا أو ما إذا كان أحد الأنشطة أفضل بكثير من الآخر. يعمل الجاكوزي (حوض الاستحمام الساخن) أو حمام الساونا (غرفة البخار) عادةً على تحسين صحة الفرد بعدة طرق. كلاهما يدعم أجسامنا بطرق متشابهة ، مثل تخفيف التوتر. ولكن ، كل واحد يقدم أيضًا فرصًا خاصة لتحسين صحتنا......  ", "", ""]
  },
  {
    title: "الفوائد الصحية للساونا العادية واستخدام الجاكوزي",
    date: "25 يونيو 2023. 12:42pm ",
    img: "https://placehold.co/600x400",
    postInfo: ["هناك العديد من الفوائد لاستخدام الجاكوزي والساونا بانتظام. يمكن أن تستفيد صحة الشخص من بضع دقائق فقط يوميًا ، جسديًا وعقليًا. العديد من الأبحاث تدعم قيمة الانخراط في كلا النشاطين. ومع ذلك ، فإن قلة من الناس يدركون النطاق الكامل للمزايا أو ما إذا كان أحد الأنشطة أفضل بكثير من الآخر. يعمل الجاكوزي (حوض الاستحمام الساخن) أو حمام الساونا (غرفة البخار) عادةً على تحسين صحة الفرد بعدة طرق. كلاهما يدعم أجسامنا بطرق متشابهة ، مثل تخفيف التوتر. ولكن ، كل واحد يقدم أيضًا فرصًا خاصة لتحسين صحتنا......  ", "", ""]
  },{
    title: "الفوائد الصحية للساونا العادية واستخدام الجاكوزي",
    date: "25 يونيو 2023. 12:42pm ",
    img: "https://placehold.co/600x400",
    postInfo: ["هناك العديد من الفوائد لاستخدام الجاكوزي والساونا بانتظام. يمكن أن تستفيد صحة الشخص من بضع دقائق فقط يوميًا ، جسديًا وعقليًا. العديد من الأبحاث تدعم قيمة الانخراط في كلا النشاطين. ومع ذلك ، فإن قلة من الناس يدركون النطاق الكامل للمزايا أو ما إذا كان أحد الأنشطة أفضل بكثير من الآخر. يعمل الجاكوزي (حوض الاستحمام الساخن) أو حمام الساونا (غرفة البخار) عادةً على تحسين صحة الفرد بعدة طرق. كلاهما يدعم أجسامنا بطرق متشابهة ، مثل تخفيف التوتر. ولكن ، كل واحد يقدم أيضًا فرصًا خاصة لتحسين صحتنا......  ", "", ""]
  }
]




export default function BlogList() {

  const HtmlPosts: Array<JSX.Element> = posts.map(({ title, date, img, postInfo }, i) => {
    return (
      <div key={i} className="pr-4 mt-2 text-center lg:text-right" >
        <h1 className=" font-extrabold lg:text-4xl md:text-3xl text-2xl max-w-[90%] ">{title}</h1>
        <div className='flex gap-1 m-2'>
          <CgCalendarDates className="mt-[2.5px] lg:text-base text-sm" />
          <p className="lg:text-sm text-xs">{date}</p>
        </div>
        <img src={img} alt={`post ${i} img`} className=' h-80 w-[90%] object-cover' />
        {postInfo.map((info, i) => {
          return (
            <p key={i} className='lg:text-sm text-xs max-w-[90%] my-2'>{info}</p>
          )
        })}
        <div className='w-[90%] h-4 border-t-2 border-[#000] mt-6'></div>
      </div>
    )
  })


  return (
    <div >
      {HtmlPosts}
    </div>
  );
}
