import { useState } from "react";
import Hero from "./Hero";
import Project from "./Project";
import ProjectsList from "./ProjectsList";

const projects = [
  {
    name: "1اسم المشروع",
    description: [
      "يتم كتابة اللغة العربية باستخدام النص العربي. يتم تصنيفها على أنها أبجد ، لأنها تتكون عمومًا من أحرف ثابتة فقط ، على الرغم من أنه يمكن الإشارة إلى أحرف العلة باستخدام علامات التشكيل ، وعادة ما يتم كتابتها بالكامل للكلمات المستعارة. يحتوي النص العربي القياسي على 28 حرفًا ، وعلى عكس الأبجدية الأوروبية مثل اللاتينية واليونانية ، فإنه يُكتب من اليمين إلى اليسار. لم يتم تمييز الأحرف الكبيرة والصغيرة ، ولكن قد تحتوي الأحرف على ما يصل إلى أربعة أشكال مختلفة اعتمادًا على موضعها في الكلمة. تُكتب اللغة العربية دائمًا بأسلوب متصل ، مع ربط الأحرف ببعضها البعض ، وهناك عدد كبير من الحروف المركبة التي تجمع بين أحرف متعددة في رمز واحد.",
      "يُرجح أن نظام الكتابة العربية مشتق من الأبجدية النبطية. كان أول شكل من أشكال النص يتكون من 22 حرفًا فقط ولا يمكنه التعبير بشكل كامل عن جميع أصوات اللغة العربية ، لذا فإن الكتابة العربية المبكرة ستستخدم نفس الحرف لأصوات مختلفة. لا يوجد سوى عدد قليل من النقوش المؤكدة قبل الإسلام ، ولم يتم الانتهاء من النص العربي بالكامل حتى كتابة القرآن في القرن السابع الميلادي.",
      "اليوم ، بالإضافة إلى اللغة العربية ، التي يتحدث بها مئات الملايين من الناس في عدة أنواع ، يتم استخدام الأبجدية العربية أيضًا لكتابة لغات أخرى بأشكال معدلة. تُستخدم الاختلافات في النص العربي لكتابة الفارسية والأردية والأويغورية ، ويمكن أيضًا استخدامها للكشميرية والماليزية والكردية وغيرها الكثير ، أحيانًا اعتمادًا على البلد. لقد أثرت اللغة العربية نفسها على العديد من الآخرين ، حيث زودت الرياضيات والعلوم بمفردات مثل الجبر والكيمياء."],
    imgs: ["/ImgsProjexts/image.png","/ImgsProducts/heroImg.webp","/ImgsProjexts/Vector.webp"]
  },
  {
    name: "2اسم المشروع",
    description: [
      "يتم كتابة اللغة العربية باستخدام النص العربي. يتم تصنيفها على أنها أبجد ، لأنها تتكون عمومًا من أحرف ثابتة فقط ، على الرغم من أنه يمكن الإشارة إلى أحرف العلة باستخدام علامات التشكيل ، وعادة ما يتم كتابتها بالكامل للكلمات المستعارة. يحتوي النص العربي القياسي على 28 حرفًا ، وعلى عكس الأبجدية الأوروبية مثل اللاتينية واليونانية ، فإنه يُكتب من اليمين إلى اليسار. لم يتم تمييز الأحرف الكبيرة والصغيرة ، ولكن قد تحتوي الأحرف على ما يصل إلى أربعة أشكال مختلفة اعتمادًا على موضعها في الكلمة. تُكتب اللغة العربية دائمًا بأسلوب متصل ، مع ربط الأحرف ببعضها البعض ، وهناك عدد كبير من الحروف المركبة التي تجمع بين أحرف متعددة في رمز واحد.",
      "يُرجح أن نظام الكتابة العربية مشتق من الأبجدية النبطية. كان أول شكل من أشكال النص يتكون من 22 حرفًا فقط ولا يمكنه التعبير بشكل كامل عن جميع أصوات اللغة العربية ، لذا فإن الكتابة العربية المبكرة ستستخدم نفس الحرف لأصوات مختلفة. لا يوجد سوى عدد قليل من النقوش المؤكدة قبل الإسلام ، ولم يتم الانتهاء من النص العربي بالكامل حتى كتابة القرآن في القرن السابع الميلادي.",
      "اليوم ، بالإضافة إلى اللغة العربية ، التي يتحدث بها مئات الملايين من الناس في عدة أنواع ، يتم استخدام الأبجدية العربية أيضًا لكتابة لغات أخرى بأشكال معدلة. تُستخدم الاختلافات في النص العربي لكتابة الفارسية والأردية والأويغورية ، ويمكن أيضًا استخدامها للكشميرية والماليزية والكردية وغيرها الكثير ، أحيانًا اعتمادًا على البلد. لقد أثرت اللغة العربية نفسها على العديد من الآخرين ، حيث زودت الرياضيات والعلوم بمفردات مثل الجبر والكيمياء."],
    imgs: ["/ImgsProjexts/image.png","/ImgsProjexts/image.png","/ImgsProjexts/image.png"]
  },
  {
    name: "3اسم المشروع",
    description: [
      "يتم كتابة اللغة العربية باستخدام النص العربي. يتم تصنيفها على أنها أبجد ، لأنها تتكون عمومًا من أحرف ثابتة فقط ، على الرغم من أنه يمكن الإشارة إلى أحرف العلة باستخدام علامات التشكيل ، وعادة ما يتم كتابتها بالكامل للكلمات المستعارة. يحتوي النص العربي القياسي على 28 حرفًا ، وعلى عكس الأبجدية الأوروبية مثل اللاتينية واليونانية ، فإنه يُكتب من اليمين إلى اليسار. لم يتم تمييز الأحرف الكبيرة والصغيرة ، ولكن قد تحتوي الأحرف على ما يصل إلى أربعة أشكال مختلفة اعتمادًا على موضعها في الكلمة. تُكتب اللغة العربية دائمًا بأسلوب متصل ، مع ربط الأحرف ببعضها البعض ، وهناك عدد كبير من الحروف المركبة التي تجمع بين أحرف متعددة في رمز واحد.",
      "يُرجح أن نظام الكتابة العربية مشتق من الأبجدية النبطية. كان أول شكل من أشكال النص يتكون من 22 حرفًا فقط ولا يمكنه التعبير بشكل كامل عن جميع أصوات اللغة العربية ، لذا فإن الكتابة العربية المبكرة ستستخدم نفس الحرف لأصوات مختلفة. لا يوجد سوى عدد قليل من النقوش المؤكدة قبل الإسلام ، ولم يتم الانتهاء من النص العربي بالكامل حتى كتابة القرآن في القرن السابع الميلادي.",
      "اليوم ، بالإضافة إلى اللغة العربية ، التي يتحدث بها مئات الملايين من الناس في عدة أنواع ، يتم استخدام الأبجدية العربية أيضًا لكتابة لغات أخرى بأشكال معدلة. تُستخدم الاختلافات في النص العربي لكتابة الفارسية والأردية والأويغورية ، ويمكن أيضًا استخدامها للكشميرية والماليزية والكردية وغيرها الكثير ، أحيانًا اعتمادًا على البلد. لقد أثرت اللغة العربية نفسها على العديد من الآخرين ، حيث زودت الرياضيات والعلوم بمفردات مثل الجبر والكيمياء."],
    imgs: ["/ImgsProjexts/image.png","/ImgsProjexts/image.png","/ImgsProjexts/image.png"]
  },
  {
    name: "4اسم المشروع",
    description: [
      "يتم كتابة اللغة العربية باستخدام النص العربي. يتم تصنيفها على أنها أبجد ، لأنها تتكون عمومًا من أحرف ثابتة فقط ، على الرغم من أنه يمكن الإشارة إلى أحرف العلة باستخدام علامات التشكيل ، وعادة ما يتم كتابتها بالكامل للكلمات المستعارة. يحتوي النص العربي القياسي على 28 حرفًا ، وعلى عكس الأبجدية الأوروبية مثل اللاتينية واليونانية ، فإنه يُكتب من اليمين إلى اليسار. لم يتم تمييز الأحرف الكبيرة والصغيرة ، ولكن قد تحتوي الأحرف على ما يصل إلى أربعة أشكال مختلفة اعتمادًا على موضعها في الكلمة. تُكتب اللغة العربية دائمًا بأسلوب متصل ، مع ربط الأحرف ببعضها البعض ، وهناك عدد كبير من الحروف المركبة التي تجمع بين أحرف متعددة في رمز واحد.",
      "يُرجح أن نظام الكتابة العربية مشتق من الأبجدية النبطية. كان أول شكل من أشكال النص يتكون من 22 حرفًا فقط ولا يمكنه التعبير بشكل كامل عن جميع أصوات اللغة العربية ، لذا فإن الكتابة العربية المبكرة ستستخدم نفس الحرف لأصوات مختلفة. لا يوجد سوى عدد قليل من النقوش المؤكدة قبل الإسلام ، ولم يتم الانتهاء من النص العربي بالكامل حتى كتابة القرآن في القرن السابع الميلادي.",
      "اليوم ، بالإضافة إلى اللغة العربية ، التي يتحدث بها مئات الملايين من الناس في عدة أنواع ، يتم استخدام الأبجدية العربية أيضًا لكتابة لغات أخرى بأشكال معدلة. تُستخدم الاختلافات في النص العربي لكتابة الفارسية والأردية والأويغورية ، ويمكن أيضًا استخدامها للكشميرية والماليزية والكردية وغيرها الكثير ، أحيانًا اعتمادًا على البلد. لقد أثرت اللغة العربية نفسها على العديد من الآخرين ، حيث زودت الرياضيات والعلوم بمفردات مثل الجبر والكيمياء."],
    imgs: ["/ImgsProjexts/image.png","/ImgsProjexts/image.png","/ImgsProjexts/image.png"]
  }
]

export default function Projects() {


  const [index, setIndex] = useState<number>(0)

  return (
    <div>
      <Hero projectName = {projects[index].name} projectImg = {projects[index].imgs[0]} />
      <Project projectImgs = {projects[index].imgs} projectDescription = {projects[index].description} />
      <ProjectsList  projects = {projects} setIndex = {setIndex} />
    </div>
  );
}
